[
    {
        "code": "H",
        "name": "Henkilökunta",
        "responsibility": "liikennöitsijä / ulkopuolinen",
        "secondary": false,
        "description": "Kaikki myöhästymiset, jotka johtuvat junassa toimivan henkilökunnan puuttumisesta tai toiminnasta (esimerkiksi lähtövalmius-/lähtöpoikkeamailmoituksen tekemättä jääminen). Lisäksi myöhästymiset, jotka johtuvat junan lähtövalmisteluihin liittyvän henkilökunnan puuttumisesta (esim. vaihtotyönjohtaja tai jarrujenkoettelija). Myös muun toimijan kuin liikennöitsijän henkilökuntaan liittyvästä syystä johtuvat myöhästymiset (esim. vaihdemiehen puuttuminen tai kuljetusasiakkaan henkilökunnan toimintavirhe)."
    },
    {
        "code": "J",
        "name": "Junan muodostamisen viivästyminen",
        "responsibility": "liikennöitsijä",
        "secondary": false,
        "description": "Myöhästymiset, jotka liittyvät junanmuodostamisen viivästymiseen."
    },
    {
        "code": "K",
        "name": "Kalusto, moottorijunat ja vaunut",
        "responsibility": "liikennöitsijä",
        "secondary": false,
        "description": "Myöhästymiset, jotka johtuvat kaluston tai moottorijunien vioista. Myös Edo-ohjausvaunut kuuluvat kalustoon. Myös myöhästymiset, jotka johtuvat kalustopulasta. Lisäksi myöhästymiset, jotka johtuvat ongelmista kaluston kytkennässä ja irrotuksessa matkan aikana."
    },
    {
        "code": "V",
        "name": "Vetokalusto",
        "responsibility": "liikennöitsijä",
        "secondary": false,
        "description": "Veturien vioista tai veturipulasta aiheutuvat myöhästymiset."
    },
    {
        "code": "A",
        "name": "Aikataulu ja liikennöinti",
        "responsibility": "liikennöitsijä",
        "secondary": false,
        "description": "Pääasiassa mäkeenjäänneistä aiheutuvat myöhästymiset."
    },
    {
        "code": "E",
        "name": "Etuajassakulku",
        "responsibility": "liikennöitsijä / liikenteenohjaus",
        "secondary": true,
        "description": "Vain tavaraliikenteen etuajassakulut."
    },
    {
        "code": "L",
        "name": "Liikenteenhoito",
        "responsibility": "liikenteenohjaus / liikennöitsijä / ulkopuolinen / radanpitäjä",
        "secondary": true,
        "description": "Myöhästymiset, jotka johtuvat liikenneteknisistä ja liikenteen hoitoon liittyvistä syistä. Syyt ovat pääasiassa sekundäärisiä myöhästymissyitä."
    },
    {
        "code": "P",
        "name": "Liikenteenhoitojärjestelmät",
        "responsibility": "radanpitäjä / liikenteenohjaus / liikennöitsijä / ulkopuolinen",
        "secondary": false,
        "description": "Kaikki radanpitäjän sekä myös muiden tahojen (liikenteenohjaus, liikennöitsijä) vastuulla olevien laitteiden ja tietojärjestelmien viat. Myös myöhästymiset, jotka johtuvat lähtötietojen puuttumisesta teknisistä syistä. Lisäksi viestintälaite/-yhteysvioista johtuvat myöhästymiset. Näiden syiden osalta vastuutaho voi olla radanpitäjä, liikenteenohjaus tai liikennöitsijä, mutta siihen ei oteta kantaa kirjausta tehdessä, koska tarkempi syy selviää usein vasta myöhemmin."
    },
    {
        "code": "S",
        "name": "Sähkörata",
        "responsibility": "radanpitäjä / ulkopuolinen",
        "secondary": false,
        "description": "Sähkörataan liittyvistä vioista tai sähkönjakeluhäiriöistä aiheutuvat myöhästymiset.  Huomioitavaa on, ettei vian ilmetessä välttämättä vielä tiedetä, onko vian taustalla kantaverkkoon liittyvä vika vai ei. 1-tason syykoodi voi siis muuttua sen jälkeen, kun kunnossapito on todennut todellisen syyn."
    },
    {
        "code": "T",
        "name": "Rata (ratarakenne)",
        "responsibility": "radanpitäjä",
        "secondary": false,
        "description": "Myöhästymiset, jotka johtuvat nopeusrajoituksesta, ratarikosta tai esteestä radalla."
    },
    {
        "code": "R",
        "name": "Ratatyö",
        "responsibility": "radanpitäjä",
        "secondary": false,
        "description": "Ratatöihin liittyvistä syistä aiheutuneet myöhästymiset. Sisältää ennakkoon sovitut ratatyöt nopeusrajoituksineen sekä kaikki poikkeamat sovituista ratatöistä."
    },
    {
        "code": "O",
        "name": "Onnettomuus",
        "responsibility": "ulkopuolinen",
        "secondary": false,
        "description": "Luetaan ulkopuolisiksi syiksi. Junan kuljettaja ilmoittaa liikenneohjaajalle onnettomuuksista, ilkivallasta ja asiattomasta radalla liikkumisesta, mutta myös liikenneohjaaja voi tehdä havainnon valvontakameroiden avulla. Ilmoitus voi tulla myös hätäkeskukselta."
    },
    {
        "code": "M",
        "name": "Matkustajapalvelu",
        "responsibility": "ulkopuolinen",
        "secondary": false,
        "description": "Matkustajiin tai matkustajapalveluun liittyvistä syistä aiheutuneet myöhästymiset. Näihin kuuluvat myös passi- ja tullitarkastukset."
    },
    {
        "code": "I",
        "name": "Muut syyt",
        "responsibility": "ulkopuolinen",
        "secondary": false,
        "description": "Säästä, ilkivallasta tai poikkeuksellisista tapauksista aiheutuneet myöhästymiset."
    }
]